{
  "name": "annotrack",
  "display_name": "annotrack",
  "visibility": "public",
  "icon": "",
  "categories": [],
  "schema_version": "0.1.0",
  "on_activate": null,
  "on_deactivate": null,
  "contributions": {
    "commands": [
      {
        "id": "annotrack.sample_from_csv",
        "title": "Create sample_from_csv",
        "python_name": "annotrack._dock_widgets:sample_from_csv",
        "short_title": null,
        "category": null,
        "icon": null,
        "enablement": null
      },
      {
        "id": "annotrack.annotate_existing_samples",
        "title": "Create annotate_existing_samples",
        "python_name": "annotrack._dock_widgets:annotate_existing_samples",
        "short_title": null,
        "category": null,
        "icon": null,
        "enablement": null
      }
    ],
    "readers": null,
    "writers": null,
    "widgets": [
      {
        "command": "annotrack.sample_from_csv",
        "display_name": "sample_from_csv",
        "autogenerate": false
      },
      {
        "command": "annotrack.annotate_existing_samples",
        "display_name": "annotate_existing_samples",
        "autogenerate": false
      }
    ],
    "sample_data": null,
    "themes": null,
    "menus": {},
    "submenus": null,
    "keybindings": null,
    "configuration": []
  },
  "package_metadata": {
    "metadata_version": "2.1",
    "name": "annotrack",
    "version": "0.0.3",
    "dynamic": null,
    "platform": null,
    "supported_platform": null,
    "summary": "napari plugin for annotating tracks to estimate error rates",
    "description": "# annotrack\nAnnotrack is a napari plugin for annotating errors in object trajectories. The plugin will help you take a sample of track segments along with a small section of corresponding image and segmentation. Annotrack allows you to annotate three types of errors: (1) ID swap errors (track jumps between objects), (2) false starts (track starts on a pre-existing object) and false terminations (track ends but object still exists). By looking at the combined rates of false starts and false terminations you can assess track discontinutation errors. \n\n**Please note:** Images and segmentations must be in zarr format. Tracks should be in parquet format.  \n\n## Installation \n\nThere are three main ways to install annotrack:\n\n### Install Using pip\n*Please note that this is planned/under development*\n\nType the following into your terminal (MacOS or Ubuntu) or annaconda prompt (windows):\n\n```bash\npip install annotrack\n```\n\n### Install\n*Please note that this is planned/under development*\n\nType the following into your terminal (MacOS or Ubuntu) or annaconda prompt (windows):\n\n```bash\ninstall napari\nnapari\n```\n\nOnce napari has opened (this may take a second the first time you open it), go to the pannel at the top of the screen and select the 'plugins' dropdown. Then select install/uninstall plugins. A new window will open showing available plugins. Either scroll down to or search 'annotrack' and click 'install'. \n\n### Install from Source Code\n*please use this for now*\n\nType the following into your terminal (MacOS or Ubuntu) or annaconda prompt (windows):\n\n```bash\ngit clone https://github.com/AbigailMcGovern/annotrack.git\ncd annotrack\npip install .\n```\n\n## Opening Annotrack\nOnce annotrack is properly installed you will be able to open annotrack by opening napari. You can open napari through the command line (terminal (MacOS or Ubuntu) or annaconda prompt (windows)) as follows:\n\n```bash\nnapari\n```\n\nYou can find the annotrack widgets by selecting the dropdown 'plugins' at the pannel at the top of the screen and hovering over 'annotrack'.  \n\n## Sample from CSV\n\nTo sample your tracks you will need to supply the file paths for the images, segmentations, and tracks. You supply this in a csv that is structured as shown below:\n\n ![csv_structure widget](https://github.com/AbigailMcGovern/annotrack/blob/main/media/csv_structure.png)\n\nIn this csv, you may also specify how many samples are to be taken from each file. If this is not provided, annotrack will use the value you supply to the `sample_from_csv` widget. The csv must contain a column that specifies a category to which each sample belongs (e.g., species, experimental condition, drug, etc.).  If this isnt important for your samples, just add a dummy category (e.g., sample_type : [A, A, A, A]). \n\nTo access the widget and sample track segments, go to the top of the screen, go to **plugins > annotrack > sample_from_csv**. When the widget is displayed, select the csv file, select a directory into which to save results, and proivide a name for the summary data file (i.e., where your annotations will be written). \n\n ![sample_from_csv widget](https://github.com/AbigailMcGovern/annotrack/blob/main/media/sample_from_csv.png)\n\n### Widget parameters\n- **path to csv**: \n        The path storing the info from which to generate the samples. \n        The CSV should have the columns: image_path, labels_path, tracks_path, <category_col>, \n        You can also add an optional n_samples column if you would like to \n        specify how many samples to take from each individual file. Otherwise, \n        the default \"n_samples\" you've supplied will be used.\n- **output dir**: \n        Where will the output be saved?\n- **output name**: \n        What will output summary files/directories be called?\n- **n samples**: \n        How many samples to be obtained from each file. Will be overwritten\n        if there is a valid integer number in the n_samples colum of the csv.\n- **tzyx cols**: \n        What are the names of the columns denoting time (in frames) and coordinate\n        positions (in pixels) in the file containing tracks? The order should be:\n        t, z, y, x. \n- **id col**: \n        What is the name of the column denoting the specific ID for each tracked\n        object?\n- **scale**: \n        size of pixels (e.g., in um) for the z, y, and x coordinates (in that\n        order)\n- **frames**: \n        Approximate maximum number of frames of track segment. \n        Max frames = frames (if even) or frames - 1 (if odd)\n- **box size**: \n        Approximate size of bounding box (in pixels). \n- **min track len**: \n        You can set a minimum track len to include in the search. \n        This can help to eliminate less useful data. This should be at least 1 to only include tracked objects. Set higher only if you are specifically interested in longer lived tracks. \n- **image channel**: \n        This denotes the index of the channel from which to get \n        image data (0: channel 1, 1: channel 2, 2: channel 3, 3: channel 4)\n\n### Annotate Now?\n\nIn the case that we are annotating multiple conditions to compare, we want to show them in the one session in randomised order with the annotator blinded to where the sample has originated from. We want to be able to annotated unannotated data from the sample without having the burden of having to do this all at once. The annotations are therefore saved into the saved sample. A selected number of samples saved from the various tracking experiments can be annotated using the following code. If you re-execute this code, you will only be shown not yet annotated data, unless you request otherwise.\n\nKeys to navagate and annotate samples\n- '2' - move to next sample\n- '1' - move to previous sample\n- 'y' - annotate as correct (will move to the next sample automatically)\n- 'n' - annotate as containing an error (will move to the next sample automatically)\n- 'i' - annotate the frame following a ID swap error\n- 't' - annotate the fame following an incorrect termination\n- 'Shift-t' - annotate the frame containing a false start error\n- 's' - annotate an error ('i', 't', or 'Shift-t') as being associated with a segmentation error (merge or split of objects)\n\nWhen an error is associated the specific frame ('i', 't', 'Shift-t', or 's'), the frame number (within the original image) will be added to a list of errors for the sample within the sample's (.smpl) info data frame. E.g., you may have a list of ID swaps for your sampled track segment (`[108, 111, 112]`) and a corresponding list of segmentation error associations (`[108, 112]`). \n\n## Annotate Existing Sample\nIf you have already saved a sample and want to annotate it, you can load the sample data using the `annotate_existing_sample` widget. This might be useful if you want to have several annotators annotate the same sample. To access this widget, open napari\n\n ![annotate_existing_sample widget](https://github.com/AbigailMcGovern/annotrack/blob/main/media/annotate_existing_sample.png)\n\n## Contributing and User Support\n\n**User support:** If you have an issue with annotrack please add an issue (go to the Issues tab at the top of the GitHub page). If your issue is a bug, please include as much information as possible to help debug the problem. Examples of information include: details about the image and segmentation data (dimensions), number of images, number of samples you are trying to take. If you are requesting an improvement, try to be as clear as possible about what you need. \n\n**Contributing:** If you want to contribute to annotrack, please fork the repo and if you want to make changes make a pull request with as much detail about the change as possible. Please ensure any changes you want to make don't break the existing functions.\n",
    "description_content_type": "text/markdown",
    "keywords": null,
    "home_page": "https://github.com/abigailmcgovern/annotrack",
    "download_url": null,
    "author": "Abigail S McGovern",
    "author_email": "abigail_mcgovern@hotmail.com",
    "maintainer": null,
    "maintainer_email": null,
    "license": "BSD-3-Clause",
    "classifier": [
      "Programming Language :: Python :: 3",
      "License :: OSI Approved :: BSD License",
      "Operating System :: OS Independent",
      "Intended Audience :: Science/Research",
      "Topic :: Scientific/Engineering",
      "Topic :: Scientific/Engineering :: Image Processing",
      "Framework :: napari"
    ],
    "requires_dist": [
      "dask",
      "napari",
      "numpy",
      "zarr",
      "pandas",
      "sphinx ; extra == 'docs'",
      "nd2 ; extra == 'io'",
      "pytest ; extra == 'testing'"
    ],
    "requires_python": ">=3.7",
    "requires_external": null,
    "project_url": [
      "Bug Tracker, https://github.com/abigailmcgovern/annotrack/issues",
      "Documentation, https://github.com/abigailmcgovern/annotrack#README.md",
      "Source Code, https://github.com/abigailmcgovern/annotrack",
      "User Support, https://github.com/abigailmcgovern/annotrack/issues"
    ],
    "provides_extra": [
      "docs",
      "io",
      "testing"
    ],
    "provides_dist": null,
    "obsoletes_dist": null
  },
  "npe1_shim": false
}