{
  "info": {
    "author": "Herearii Metuareea",
    "author_email": "herearii.metuarea@gmail.com",
    "bugtrack_url": null,
    "classifiers": [
      "Development Status :: 2 - Pre-Alpha",
      "Framework :: napari",
      "Intended Audience :: Developers",
      "License :: OSI Approved :: GNU Lesser General Public License v3 (LGPLv3)",
      "Operating System :: OS Independent",
      "Programming Language :: Python",
      "Programming Language :: Python :: 3",
      "Programming Language :: Python :: 3 :: Only",
      "Programming Language :: Python :: 3.10",
      "Programming Language :: Python :: 3.11",
      "Programming Language :: Python :: 3.12",
      "Programming Language :: Python :: 3.13",
      "Topic :: Scientific/Engineering :: Image Processing"
    ],
    "description": "# DeepPhenoTree\r\n\r\n[![License GNU LGPL v3.0](https://img.shields.io/pypi/l/deepphenotree.svg?color=green)](https://github.com/hereariim/deepphenotree/raw/main/LICENSE)\r\n[![PyPI](https://img.shields.io/pypi/v/deepphenotree.svg?color=green)](https://pypi.org/project/deepphenotree)\r\n[![Python Version](https://img.shields.io/pypi/pyversions/deepphenotree.svg?color=green)](https://python.org)\r\n[![tests](https://github.com/hereariim/deepphenotree/workflows/tests/badge.svg)](https://github.com/hereariim/deepphenotree/actions)\r\n[![codecov](https://codecov.io/gh/hereariim/deepphenotree/branch/main/graph/badge.svg)](https://codecov.io/gh/hereariim/deepphenotree)\r\n[![napari hub](https://img.shields.io/endpoint?url=https://api.napari-hub.org/shields/deepphenotree)](https://napari-hub.org/plugins/deepphenotree)\r\n[![npe2](https://img.shields.io/badge/plugin-npe2-blue?link=https://napari.org/stable/plugins/index.html)](https://napari.org/stable/plugins/index.html)\r\n[![Copier](https://img.shields.io/endpoint?url=https://raw.githubusercontent.com/copier-org/copier/master/img/badge/badge-grayscale-inverted-border-purple.json)](https://github.com/copier-org/copier)\r\n\r\nHerearii Metuarea, Walter Guerra† ,  Andrea Patocchi, Lidia Lozano,  Shauny Van Hoye,  Francois Laurens, Jeremy Labrosse,  Pejman Rasti,  David Rousseau† \r\n\r\n† project lead\r\n\r\n<img width=\"1920\" height=\"165\" alt=\"445202004-4a110408-5854-4e8c-b655-4cb588434b79\" src=\"https://github.com/user-attachments/assets/094464d1-8ce8-474b-8473-4a14973cff47\" />\r\n\r\n<img width=\"960\" height=\"540\" alt=\"DeepPhenoTree\" src=\"https://github.com/user-attachments/assets/ec26e2bf-5983-46aa-8f16-b01e2fdc84a9\" />\r\n\r\n\r\nDeepPhenoTree is though as a tool to enable automatic detection of phenological stages associated with flowering, fruitlet, and fruit in harvest time from images using deep learning–based object detection models.\r\n\r\nThis [napari] plugin was generated with [copier] using the [napari-plugin-template] (None).\r\n\r\n### Contribution\r\n\r\n### Article (Draft)\r\n\r\n*DeepPhenoTree – Apple Edition: a Multi-site apple phenology RGB annotated dataset with deep learning baseline models.*\r\nHerearii Metuarea, Walter Guerra,  Andrea Patocchi, Lidia Lozano,  Shauny Van Hoye,  Francois Laurens, Jeremy Labrosse,  Pejman Rasti,  David Rousseau.\r\n\r\n### Dataset\r\n\r\nHerearii METUAREA, 2026, \"DeepPhenoTree - Apple Edition\", https://doi.org/10.57745/NORPF1, Recherche Data Gouv, V1\r\n\r\n----------------------------------\r\n\r\n## Installation\r\n\r\nYou can install `deepphenotree` via [pip]:\r\n\r\n```\r\npip install deepphenotree\r\n```\r\n\r\nIf napari is not already installed, you can install `deepphenotree` with napari and Qt via:\r\n\r\n```\r\npip install \"deepphenotree[all]\"\r\n```\r\n\r\nTo install latest development version :\r\n\r\n```\r\npip install git+https://github.com/hereariim/deepphenotree.git\r\n```\r\n\r\nGPU is mandatory for time processing and models running (especially Grounding-DINO). Please visit the official PyTorch website to get the appropriate installation command:\r\n👉 https://pytorch.org/get-started/locally\r\n\r\n**Exemple : GPU (CUDA 12.1)**\r\n\r\n    pip install torch torchvision torchaudio --index-url https://download.pytorch.org/whl/cu121\r\n\r\n## Getting started\r\n\r\n### Running from Python\r\n```\r\nfrom deepphenotree.inference import YoloInferencer\r\nimage = # Your RGB image\r\n\r\n# Flowering task\r\ninfer = YoloInferencer(\"Flowering\")\r\nbbx = infer.predict_boxes(image)\r\n\r\n# Fruitlet task\r\ninfer = YoloInferencer(\"Fruitlet\")\r\nbbx = infer.predict_boxes(image)\r\n\r\n# Fruit task\r\ninfer = YoloInferencer(\"Fruit\")\r\nbbx = infer.predict_boxes(image)\r\n```\r\n\r\n### Running from Napari\r\n\r\nThis plugin is a tool to perform targeted image inference on user-provided images. Users can run three specific detection tasks via dedicated buttons: flowering, fruitlet, and fruit detection. The plugin returns the coordinates of bounding boxes around detected objects, and a message informs the user of the number of detected boxes. Several developments are ongoing—feel free to contact us if you have requests or suggestions.\r\n\r\n<img width=\"1854\" height=\"1048\" alt=\"Screenshot from 2026-01-09 16-38-04\" src=\"https://github.com/user-attachments/assets/385c5867-ffd1-4de0-8bff-2af0ca1d052b\" />\r\n\r\n### Scheme\r\n\r\n<img width=\"960\" height=\"540\" alt=\"scheme\" src=\"https://github.com/user-attachments/assets/6a7827da-a982-405e-b411-3942b2585f4c\" />\r\n\r\n### Input\r\n\r\nUser drag and drop RGB image on napari window.\r\n\r\n### Process\r\n\r\nUser click to make inference in image : \r\n- Flowering : Detect all objects (from BBCH 00 to BBCH 69) from bud developpement to flowering.\r\n- Fruitlet : Detect fruit in developement (from BBCH 71 to 77)\r\n- Fruit : Detect all fruit in harvest time (from BBCH 81 to 89)\r\n\r\n### Output\r\n\r\nBounding box displayed in layer Flowering for flowering, Fruitlet for fruitlet and Fruit for fruit.\r\n\r\n## Model\r\n\r\nDeepPhenoTree consists of a RT-DETR trained on DeepPhenoTree dataset. \r\n\r\nThe trained models used in this project are **not publicly available**. They are part of ongoing research and collaborative projects, and therefore cannot be distributed at this time.  \r\nHowever, the codebase is provided to ensure **reproducibility** and **transparency** of the proposed methodology.\r\n\r\n### Images results\r\n\r\n**Metrics are reported as mean ± standard deviation across folds.**\r\n\r\n| Dataset   | Location      | Precision       | Recall          | mAP@0.5        | mAP@0.5:0.95   |\r\n|-----------|---------------|-----------------|-----------------|---------------|---------------|\r\n| Flowering | REFPOP        | 0.69 ± 0.01     | 0.58 ± 0.02     | 0.65 ± 0.02   | 0.37 ± 0.02   |\r\n|           | Switzerland   | 0.73 ± 0.02     | 0.60 ± 0.04     | 0.68 ± 0.03   | 0.40 ± 0.04   |\r\n|           | Belgium       | 0.72 ± 0.02     | 0.63 ± 0.03     | 0.69 ± 0.03   | 0.40 ± 0.03   |\r\n|           | Spain         | 0.66 ± 0.01     | 0.53 ± 0.05     | 0.60 ± 0.03   | 0.30 ± 0.02   |\r\n|           | Italy         | 0.69 ± 0.04     | 0.61 ± 0.03     | 0.67 ± 0.04   | 0.40 ± 0.04   |\r\n| Fruitlet  | REFPOP        | 0.85 ± 0.02     | 0.73 ± 0.02     | 0.82 ± 0.02   | 0.53 ± 0.01   |\r\n|           | Switzerland   | 0.86 ± 0.04     | 0.78 ± 0.04     | 0.84 ± 0.06   | 0.56 ± 0.04   |\r\n|           | Belgium       | 0.83 ± 0.03     | 0.65 ± 0.04     | 0.77 ± 0.04   | 0.52 ± 0.14   |\r\n|           | Spain         | 0.86 ± 0.02     | 0.72 ± 0.03     | 0.81 ± 0.03   | 0.52 ± 0.03   |\r\n|           | Italy         | 0.88 ± 0.01     | 0.80 ± 0.01     | 0.88 ± 0.01   | 0.61 ± 0.01   |\r\n\r\n## DeepPhenoTree Dataset\r\n\r\nDeepPhenoTree – Apple Edition, a multi-site, multi-variety,  RGB  image  dataset  dedicated  to  the  classification  of  key  apple  treephenological stages.\r\n\r\n<img width=\"1920\" height=\"1080\" alt=\"IRTA_time\" src=\"https://github.com/user-attachments/assets/9eae80e6-73e1-45ad-b5e5-70a41807301b\" />\r\n\r\n\r\n## Acknowlegments\r\n\r\nWe would like to thank the following people for their contributions to the project: Herearii Metuarea, Lou Decastro, Jade Marhadour, Oumaima Karia, Lorène Masson, Marie Kourkoumelis-Rodostamos, Abdoul-Djalil Hamza Ousseinni, Walter Guerra, Francesca Zuffa, Francesco Panzeri,  Andrea Patocchi, Lidia Lozano,  Shauny Van Hoye,  Francois Laurens, Jeremy Labrosse,  Pejman Rasti,  David Rousseau.\r\n\r\n## Contact\r\n\r\nImhorphen team, bioimaging research group\r\n42 rue George Morel, Angers, France\r\n\r\n- Herearii Metuarea, herearii.metuarea@univ-angers.fr\r\n- Abdoul-Djalil Hamza Ousseini, abdoul-djalil.ousseini-hamza@inrae.fr\r\n- Pr David Rousseau, david.rousseau@univ-angers.fr\r\n\r\n## Contributing\r\n\r\nContributions are very welcome. Tests can be run with [tox], please ensure\r\nthe coverage at least stays the same before you submit a pull request.\r\n\r\n## License\r\n\r\nDistributed under the terms of the [GNU LGPL v3.0] license,\r\n\"deepphenotree\" is free and open source software\r\n\r\n## Issues\r\n\r\nIf you encounter any problems, please [file an issue] along with a detailed description.\r\n\r\n## Citing\r\n\r\nIf you use DeepPhenoTree code or dataset in your research, please use the following BibTeX entry.\r\n\r\n```\r\nNot available\r\n```\r\n\r\n[napari]: https://github.com/napari/napari\r\n[copier]: https://copier.readthedocs.io/en/stable/\r\n[@napari]: https://github.com/napari\r\n[MIT]: http://opensource.org/licenses/MIT\r\n[BSD-3]: http://opensource.org/licenses/BSD-3-Clause\r\n[GNU GPL v3.0]: http://www.gnu.org/licenses/gpl-3.0.txt\r\n[GNU LGPL v3.0]: http://www.gnu.org/licenses/lgpl-3.0.txt\r\n[Apache Software License 2.0]: http://www.apache.org/licenses/LICENSE-2.0\r\n[Mozilla Public License 2.0]: https://www.mozilla.org/media/MPL/2.0/index.txt\r\n[napari-plugin-template]: https://github.com/napari/napari-plugin-template\r\n\r\n[file an issue]: https://github.com/hereariim/deepphenotree/issues\r\n\r\n[napari]: https://github.com/napari/napari\r\n[tox]: https://tox.readthedocs.io/en/latest/\r\n[pip]: https://pypi.org/project/pip/\r\n[PyPI]: https://pypi.org/\r\n",
    "description_content_type": "text/markdown",
    "docs_url": null,
    "download_url": null,
    "downloads": {
      "last_day": -1,
      "last_month": -1,
      "last_week": -1
    },
    "dynamic": [
      "License-File"
    ],
    "home_page": null,
    "keywords": null,
    "license": "\r\n                           GNU LESSER GENERAL PUBLIC LICENSE\r\n                               Version 3, 29 June 2007\r\n        \r\n         Copyright (C) 2007 Free Software Foundation, Inc. <https://fsf.org/>\r\n         Everyone is permitted to copy and distribute verbatim copies\r\n         of this license document, but changing it is not allowed.\r\n        \r\n        \r\n          This version of the GNU Lesser General Public License incorporates\r\n        the terms and conditions of version 3 of the GNU General Public\r\n        License, supplemented by the additional permissions listed below.\r\n        \r\n          0. Additional Definitions.\r\n        \r\n          As used herein, \"this License\" refers to version 3 of the GNU Lesser\r\n        General Public License, and the \"GNU GPL\" refers to version 3 of the GNU\r\n        General Public License.\r\n        \r\n          \"The Library\" refers to a covered work governed by this License,\r\n        other than an Application or a Combined Work as defined below.\r\n        \r\n          An \"Application\" is any work that makes use of an interface provided\r\n        by the Library, but which is not otherwise based on the Library.\r\n        Defining a subclass of a class defined by the Library is deemed a mode\r\n        of using an interface provided by the Library.\r\n        \r\n          A \"Combined Work\" is a work produced by combining or linking an\r\n        Application with the Library.  The particular version of the Library\r\n        with which the Combined Work was made is also called the \"Linked\r\n        Version\".\r\n        \r\n          The \"Minimal Corresponding Source\" for a Combined Work means the\r\n        Corresponding Source for the Combined Work, excluding any source code\r\n        for portions of the Combined Work that, considered in isolation, are\r\n        based on the Application, and not on the Linked Version.\r\n        \r\n          The \"Corresponding Application Code\" for a Combined Work means the\r\n        object code and/or source code for the Application, including any data\r\n        and utility programs needed for reproducing the Combined Work from the\r\n        Application, but excluding the System Libraries of the Combined Work.\r\n        \r\n          1. Exception to Section 3 of the GNU GPL.\r\n        \r\n          You may convey a covered work under sections 3 and 4 of this License\r\n        without being bound by section 3 of the GNU GPL.\r\n        \r\n          2. Conveying Modified Versions.\r\n        \r\n          If you modify a copy of the Library, and, in your modifications, a\r\n        facility refers to a function or data to be supplied by an Application\r\n        that uses the facility (other than as an argument passed when the\r\n        facility is invoked), then you may convey a copy of the modified\r\n        version:\r\n        \r\n           a) under this License, provided that you make a good faith effort to\r\n           ensure that, in the event an Application does not supply the\r\n           function or data, the facility still operates, and performs\r\n           whatever part of its purpose remains meaningful, or\r\n        \r\n           b) under the GNU GPL, with none of the additional permissions of\r\n           this License applicable to that copy.\r\n        \r\n          3. Object Code Incorporating Material from Library Header Files.\r\n        \r\n          The object code form of an Application may incorporate material from\r\n        a header file that is part of the Library.  You may convey such object\r\n        code under terms of your choice, provided that, if the incorporated\r\n        material is not limited to numerical parameters, data structure\r\n        layouts and accessors, or small macros, inline functions and templates\r\n        (ten or fewer lines in length), you do both of the following:\r\n        \r\n           a) Give prominent notice with each copy of the object code that the\r\n           Library is used in it and that the Library and its use are\r\n           covered by this License.\r\n        \r\n           b) Accompany the object code with a copy of the GNU GPL and this license\r\n           document.\r\n        \r\n          4. Combined Works.\r\n        \r\n          You may convey a Combined Work under terms of your choice that,\r\n        taken together, effectively do not restrict modification of the\r\n        portions of the Library contained in the Combined Work and reverse\r\n        engineering for debugging such modifications, if you also do each of\r\n        the following:\r\n        \r\n           a) Give prominent notice with each copy of the Combined Work that\r\n           the Library is used in it and that the Library and its use are\r\n           covered by this License.\r\n        \r\n           b) Accompany the Combined Work with a copy of the GNU GPL and this license\r\n           document.\r\n        \r\n           c) For a Combined Work that displays copyright notices during\r\n           execution, include the copyright notice for the Library among\r\n           these notices, as well as a reference directing the user to the\r\n           copies of the GNU GPL and this license document.\r\n        \r\n           d) Do one of the following:\r\n        \r\n               0) Convey the Minimal Corresponding Source under the terms of this\r\n               License, and the Corresponding Application Code in a form\r\n               suitable for, and under terms that permit, the user to\r\n               recombine or relink the Application with a modified version of\r\n               the Linked Version to produce a modified Combined Work, in the\r\n               manner specified by section 6 of the GNU GPL for conveying\r\n               Corresponding Source.\r\n        \r\n               1) Use a suitable shared library mechanism for linking with the\r\n               Library.  A suitable mechanism is one that (a) uses at run time\r\n               a copy of the Library already present on the user's computer\r\n               system, and (b) will operate properly with a modified version\r\n               of the Library that is interface-compatible with the Linked\r\n               Version.\r\n        \r\n           e) Provide Installation Information, but only if you would otherwise\r\n           be required to provide such information under section 6 of the\r\n           GNU GPL, and only to the extent that such information is\r\n           necessary to install and execute a modified version of the\r\n           Combined Work produced by recombining or relinking the\r\n           Application with a modified version of the Linked Version. (If\r\n           you use option 4d0, the Installation Information must accompany\r\n           the Minimal Corresponding Source and Corresponding Application\r\n           Code. If you use option 4d1, you must provide the Installation\r\n           Information in the manner specified by section 6 of the GNU GPL\r\n           for conveying Corresponding Source.)\r\n        \r\n          5. Combined Libraries.\r\n        \r\n          You may place library facilities that are a work based on the\r\n        Library side by side in a single library together with other library\r\n        facilities that are not Applications and are not covered by this\r\n        License, and convey such a combined library under terms of your\r\n        choice, if you do both of the following:\r\n        \r\n           a) Accompany the combined library with a copy of the same work based\r\n           on the Library, uncombined with any other library facilities,\r\n           conveyed under the terms of this License.\r\n        \r\n           b) Give prominent notice with the combined library that part of it\r\n           is a work based on the Library, and explaining where to find the\r\n           accompanying uncombined form of the same work.\r\n        \r\n          6. Revised Versions of the GNU Lesser General Public License.\r\n        \r\n          The Free Software Foundation may publish revised and/or new versions\r\n        of the GNU Lesser General Public License from time to time. Such new\r\n        versions will be similar in spirit to the present version, but may\r\n        differ in detail to address new problems or concerns.\r\n        \r\n          Each version is given a distinguishing version number. If the\r\n        Library as you received it specifies that a certain numbered version\r\n        of the GNU Lesser General Public License \"or any later version\"\r\n        applies to it, you have the option of following the terms and\r\n        conditions either of that published version or of any later version\r\n        published by the Free Software Foundation. If the Library as you\r\n        received it does not specify a version number of the GNU Lesser\r\n        General Public License, you may choose any version of the GNU Lesser\r\n        General Public License ever published by the Free Software Foundation.\r\n        \r\n          If the Library as you received it specifies that a proxy can decide\r\n        whether future versions of the GNU Lesser General Public License shall\r\n        apply, that proxy's public statement of acceptance of any version is\r\n        permanent authorization for you to choose that version for the\r\n        Library.\r\n        ",
    "license_expression": null,
    "license_files": [
      "LICENSE"
    ],
    "maintainer": null,
    "maintainer_email": null,
    "name": "deepphenotree",
    "package_url": "https://pypi.org/project/deepphenotree/",
    "platform": null,
    "project_url": "https://pypi.org/project/deepphenotree/",
    "project_urls": {
      "Bug Tracker": "https://github.com/hereariim/deepphenotree/issues",
      "Documentation": "https://github.com/hereariim/deepphenotree#README.md",
      "Source Code": "https://github.com/hereariim/deepphenotree",
      "User Support": "https://github.com/hereariim/deepphenotree/issues"
    },
    "provides_extra": [
      "all"
    ],
    "release_url": "https://pypi.org/project/deepphenotree/0.0.3/",
    "requires_dist": [
      "numpy",
      "magicgui",
      "qtpy",
      "scikit-image",
      "sahi==0.11.36",
      "ultralytics==8.3.214",
      "napari[all]; extra == \"all\""
    ],
    "requires_python": ">=3.10",
    "summary": "A simple plugin to use models developped for flowering, fruitlet and fruit",
    "version": "0.0.3",
    "yanked": false,
    "yanked_reason": null
  },
  "last_serial": 34277197,
  "releases": {
    "0.0.2": [
      {
        "comment_text": null,
        "digests": {
          "blake2b_256": "d0577944100f32b60dbe44cb4f964a01cd354126d81e718fcf3e57c9af46cfb7",
          "md5": "61011d661300e7ffaa198d7ad3c80486",
          "sha256": "b6769022098b262da111beef55bfc56596e0314bcdb21801f8cb846de58a1570"
        },
        "downloads": -1,
        "filename": "deepphenotree-0.0.2-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "61011d661300e7ffaa198d7ad3c80486",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.10",
        "size": 5805772,
        "upload_time": "2026-02-09T18:43:37",
        "upload_time_iso_8601": "2026-02-09T18:43:37.329433Z",
        "url": "https://files.pythonhosted.org/packages/d0/57/7944100f32b60dbe44cb4f964a01cd354126d81e718fcf3e57c9af46cfb7/deepphenotree-0.0.2-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": null,
        "digests": {
          "blake2b_256": "c83dc7a3aa0a9a62ed05db13c701ddd3256df47d696deebf682257f09ed89c18",
          "md5": "3cc44ceb444ef646c75beb22ff5356c5",
          "sha256": "4f15860b6c02becb3de5847f67318d96f0b87d348aa2607fed064f90f97f81cc"
        },
        "downloads": -1,
        "filename": "deepphenotree-0.0.2.tar.gz",
        "has_sig": false,
        "md5_digest": "3cc44ceb444ef646c75beb22ff5356c5",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.10",
        "size": 5816563,
        "upload_time": "2026-02-09T18:43:40",
        "upload_time_iso_8601": "2026-02-09T18:43:40.020793Z",
        "url": "https://files.pythonhosted.org/packages/c8/3d/c7a3aa0a9a62ed05db13c701ddd3256df47d696deebf682257f09ed89c18/deepphenotree-0.0.2.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ],
    "0.0.3": [
      {
        "comment_text": null,
        "digests": {
          "blake2b_256": "1212a0ad6d660ddefcb39d1a717eb986cda876447359d22da9c500348eb08f6c",
          "md5": "5b2594837c9f9fde22efc9d9797489eb",
          "sha256": "091961bf6a139fd82fbfc858c486b2cf182a43d4f7259f67fa1f246e696d3d3f"
        },
        "downloads": -1,
        "filename": "deepphenotree-0.0.3-py3-none-any.whl",
        "has_sig": false,
        "md5_digest": "5b2594837c9f9fde22efc9d9797489eb",
        "packagetype": "bdist_wheel",
        "python_version": "py3",
        "requires_python": ">=3.10",
        "size": 5806759,
        "upload_time": "2026-02-12T21:52:45",
        "upload_time_iso_8601": "2026-02-12T21:52:45.994098Z",
        "url": "https://files.pythonhosted.org/packages/12/12/a0ad6d660ddefcb39d1a717eb986cda876447359d22da9c500348eb08f6c/deepphenotree-0.0.3-py3-none-any.whl",
        "yanked": false,
        "yanked_reason": null
      },
      {
        "comment_text": null,
        "digests": {
          "blake2b_256": "50eda84845421f047469c97fe40dd8d62fcd3344302175abac008b2cbef39dbf",
          "md5": "87d3acaf3ab7bac98a71c237a31cf64b",
          "sha256": "b2ed14da4dfa2a6d3f57b2239ccdf842266d5ae76722037ce72ca5f938977513"
        },
        "downloads": -1,
        "filename": "deepphenotree-0.0.3.tar.gz",
        "has_sig": false,
        "md5_digest": "87d3acaf3ab7bac98a71c237a31cf64b",
        "packagetype": "sdist",
        "python_version": "source",
        "requires_python": ">=3.10",
        "size": 5817833,
        "upload_time": "2026-02-12T21:52:49",
        "upload_time_iso_8601": "2026-02-12T21:52:49.919471Z",
        "url": "https://files.pythonhosted.org/packages/50/ed/a84845421f047469c97fe40dd8d62fcd3344302175abac008b2cbef39dbf/deepphenotree-0.0.3.tar.gz",
        "yanked": false,
        "yanked_reason": null
      }
    ]
  },
  "urls": [
    {
      "comment_text": null,
      "digests": {
        "blake2b_256": "1212a0ad6d660ddefcb39d1a717eb986cda876447359d22da9c500348eb08f6c",
        "md5": "5b2594837c9f9fde22efc9d9797489eb",
        "sha256": "091961bf6a139fd82fbfc858c486b2cf182a43d4f7259f67fa1f246e696d3d3f"
      },
      "downloads": -1,
      "filename": "deepphenotree-0.0.3-py3-none-any.whl",
      "has_sig": false,
      "md5_digest": "5b2594837c9f9fde22efc9d9797489eb",
      "packagetype": "bdist_wheel",
      "python_version": "py3",
      "requires_python": ">=3.10",
      "size": 5806759,
      "upload_time": "2026-02-12T21:52:45",
      "upload_time_iso_8601": "2026-02-12T21:52:45.994098Z",
      "url": "https://files.pythonhosted.org/packages/12/12/a0ad6d660ddefcb39d1a717eb986cda876447359d22da9c500348eb08f6c/deepphenotree-0.0.3-py3-none-any.whl",
      "yanked": false,
      "yanked_reason": null
    },
    {
      "comment_text": null,
      "digests": {
        "blake2b_256": "50eda84845421f047469c97fe40dd8d62fcd3344302175abac008b2cbef39dbf",
        "md5": "87d3acaf3ab7bac98a71c237a31cf64b",
        "sha256": "b2ed14da4dfa2a6d3f57b2239ccdf842266d5ae76722037ce72ca5f938977513"
      },
      "downloads": -1,
      "filename": "deepphenotree-0.0.3.tar.gz",
      "has_sig": false,
      "md5_digest": "87d3acaf3ab7bac98a71c237a31cf64b",
      "packagetype": "sdist",
      "python_version": "source",
      "requires_python": ">=3.10",
      "size": 5817833,
      "upload_time": "2026-02-12T21:52:49",
      "upload_time_iso_8601": "2026-02-12T21:52:49.919471Z",
      "url": "https://files.pythonhosted.org/packages/50/ed/a84845421f047469c97fe40dd8d62fcd3344302175abac008b2cbef39dbf/deepphenotree-0.0.3.tar.gz",
      "yanked": false,
      "yanked_reason": null
    }
  ],
  "vulnerabilities": []
}